MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1946/mcu.h
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
extern volatile unsigned char           LCDDATA20           __at(0x7B4);
#ifndef _LIB_BUILD
asm("LCDDATA20 equ 07B4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG40COM2              :1;
        unsigned SEG41COM2              :1;
        unsigned SEG42COM2              :1;
        unsigned SEG43COM2              :1;
        unsigned SEG44COM2              :1;
        unsigned SEG45COM2              :1;
    };
} LCDDATA20bits_t;
extern volatile LCDDATA20bits_t LCDDATA20bits __at(0x7B4);
// bitfield macros
#define _LCDDATA20_SEG40COM2_POSN                           0x0
#define _LCDDATA20_SEG40COM2_POSITION                       0x0
#define _LCDDATA20_SEG40COM2_SIZE                           0x1
#define _LCDDATA20_SEG40COM2_LENGTH                         0x1
#define _LCDDATA20_SEG40COM2_MASK                           0x1
#define _LCDDATA20_SEG41COM2_POSN                           0x1
#define _LCDDATA20_SEG41COM2_POSITION                       0x1
#define _LCDDATA20_SEG41COM2_SIZE                           0x1
#define _LCDDATA20_SEG41COM2_LENGTH                         0x1
#define _LCDDATA20_SEG41COM2_MASK                           0x2
#define _LCDDATA20_SEG42COM2_POSN                           0x2
#define _LCDDATA20_SEG42COM2_POSITION                       0x2
#define _LCDDATA20_SEG42COM2_SIZE                           0x1
#define _LCDDATA20_SEG42COM2_LENGTH                         0x1
#define _LCDDATA20_SEG42COM2_MASK                           0x4
#define _LCDDATA20_SEG43COM2_POSN                           0x3
#define _LCDDATA20_SEG43COM2_POSITION                       0x3
#define _LCDDATA20_SEG43COM2_SIZE                           0x1
#define _LCDDATA20_SEG43COM2_LENGTH                         0x1
#define _LCDDATA20_SEG43COM2_MASK                           0x8
#define _LCDDATA20_SEG44COM2_POSN                           0x4
#define _LCDDATA20_SEG44COM2_POSITION                       0x4
#define _LCDDATA20_SEG44COM2_SIZE                           0x1
#define _LCDDATA20_SEG44COM2_LENGTH                         0x1
#define _LCDDATA20_SEG44COM2_MASK                           0x10
#define _LCDDATA20_SEG45COM2_POSN                           0x5
#define _LCDDATA20_SEG45COM2_POSITION                       0x5
#define _LCDDATA20_SEG45COM2_SIZE                           0x1
#define _LCDDATA20_SEG45COM2_LENGTH                         0x1
#define _LCDDATA20_SEG45COM2_MASK                           0x20

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
extern volatile unsigned char           LCDDATA21           __at(0x7B5);
#ifndef _LIB_BUILD
asm("LCDDATA21 equ 07B5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24COM3              :1;
        unsigned SEG25COM3              :1;
        unsigned SEG26COM3              :1;
        unsigned SEG27COM3              :1;
        unsigned SEG28COM3              :1;
        unsigned SEG29COM3              :1;
        unsigned SEG30COM3              :1;
        unsigned SEG31COM3              :1;
    };
} LCDDATA21bits_t;
extern volatile LCDDATA21bits_t LCDDATA21bits __at(0x7B5);
// bitfield macros
#define _LCDDATA21_SEG24COM3_POSN                           0x0
#define _LCDDATA21_SEG24COM3_POSITION                       0x0
#define _LCDDATA21_SEG24COM3_SIZE                           0x1
#define _LCDDATA21_SEG24COM3_LENGTH                         0x1
#define _LCDDATA21_SEG24COM3_MASK                           0x1
#define _LCDDATA21_SEG25COM3_POSN                           0x1
#define _LCDDATA21_SEG25COM3_POSITION                       0x1
#define _LCDDATA21_SEG25COM3_SIZE                           0x1
#define _LCDDATA21_SEG25COM3_LENGTH                         0x1
#define _LCDDATA21_SEG25COM3_MASK                           0x2
#define _LCDDATA21_SEG26COM3_POSN                           0x2
#define _LCDDATA21_SEG26COM3_POSITION                       0x2
#define _LCDDATA21_SEG26COM3_SIZE                           0x1
#define _LCDDATA21_SEG26COM3_LENGTH                         0x1
#define _LCDDATA21_SEG26COM3_MASK                           0x4
#define _LCDDATA21_SEG27COM3_POSN                           0x3
#define _LCDDATA21_SEG27COM3_POSITION                       0x3
#define _LCDDATA21_SEG27COM3_SIZE                           0x1
#define _LCDDATA21_SEG27COM3_LENGTH                         0x1
#define _LCDDATA21_SEG27COM3_MASK                           0x8
#define _LCDDATA21_SEG28COM3_POSN                           0x4
#define _LCDDATA21_SEG28COM3_POSITION                       0x4
#define _LCDDATA21_SEG28COM3_SIZE                           0x1
#define _LCDDATA21_SEG28COM3_LENGTH                         0x1
#define _LCDDATA21_SEG28COM3_MASK                           0x10
#define _LCDDATA21_SEG29COM3_POSN                           0x5
#define _LCDDATA21_SEG29COM3_POSITION                       0x5
#define _LCDDATA21_SEG29COM3_SIZE                           0x1
#define _LCDDATA21_SEG29COM3_LENGTH                         0x1
#define _LCDDATA21_SEG29COM3_MASK                           0x20
#define _LCDDATA21_SEG30COM3_POSN                           0x6
#define _LCDDATA21_SEG30COM3_POSITION                       0x6
#define _LCDDATA21_SEG30COM3_SIZE                           0x1
#define _LCDDATA21_SEG30COM3_LENGTH                         0x1
#define _LCDDATA21_SEG30COM3_MASK                           0x40
#define _LCDDATA21_SEG31COM3_POSN                           0x7
#define _LCDDATA21_SEG31COM3_POSITION                       0x7
#define _LCDDATA21_SEG31COM3_SIZE                           0x1
#define _LCDDATA21_SEG31COM3_LENGTH                         0x1
#define _LCDDATA21_SEG31COM3_MASK                           0x80

// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
extern volatile unsigned char           LCDDATA22           __at(0x7B6);
#ifndef _LIB_BUILD
asm("LCDDATA22 equ 07B6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG32COM3              :1;
        unsigned SEG33COM3              :1;
        unsigned SEG34COM3              :1;
        unsigned SEG35COM3              :1;
        unsigned SEG36COM3              :1;
        unsigned SEG37COM3              :1;
        unsigned SEG38COM3              :1;
        unsigned SEG39COM3              :1;
    };
} LCDDATA22bits_t;
